def main():
    print(make_suitable_case(int(input())))


def make_suitable_case(num):
    cases = {0: "лет", 1: "год", 2: "года", 3: "года", 4: "года", 5: "лет", 6: "лет", 7: "лет", 8: "лет", 9: "лет"}
    return f"{get_num_word(num)} {cases[int(str(num)[-1])]}"


def get_num_word(num):
    nums = {1: 'один', 2: 'два', 3: 'три', 4: 'четыре', 5: 'пять',
            6: 'шесть', 7: 'семь', 8: 'восемь', 9: 'девять', 10: 'десять', 20: 'двадцать', 30: 'тридцать',
            40: 'сорок', 50: 'пятьдесят', 60: 'шестьдесят', 70: 'семьдесят', 80: 'восемьдесят',
            90: 'девяносто', 11: 'одиннадцать', 12: 'двенадцать', 13: 'тринадцать', 14: 'четырнадцать',
            15: 'пятнадцать', 16: 'шестнадцать', 17: 'семнадцать', 18: 'восемнадцать', 19: 'девятнадцать',
            100: "сто"}
    if num in nums:
        return nums[num]
    else:
        return f"{nums[num // 10 * 10]} {nums[num % 10]}"


if __name__ == '__main__':
    main()
